# data structure
# สามารถเก็บหลายข้อมูลไว้ใน 1 data

A = [] # list เปล่า มีขนาด คือ 0

# ตัวอย่างของการเก็บข้อมูลหลายๆประเภทไว้ใน list  เดียว
B = [1, 2, -5.2, 7, 11.3, "ABC", "d", 25, True]

# การบวก และการคูณของ list

C = [1, 5, 9, 2, 3]
D = ["a", "f", "j", "b"]
E = C + D # E = [1, 5, 9, 2, 3, "a", "f", "j", "b"]

F = C * 3 # F = C + C + C

# -----------------------------------------------------------------------------------------

A = [3, 1.2, "e", -7, "W"]
# ชื่อตำแหน่งใน string จะแทนด้วยตัวเลข
# 0 1    2   3  4
# 3 1.2 "e" -7 "W"

# -5 -4   -3  -2 -1
#  3  1.2 "e" -7 "W"

# call for value
B = A[3] # -7
C = A[-4] # 1.2

# call for sublist
D = A[1: -1] # D = [1.2, 'e', -7]
E = A[3:] # E = [-7, 'W']
F = A[: -4] # F = [3]

G = A[2] # G = "e"
H = A[2: 3] # H = ["e"]

# -----------------------------------------------------------------------------------------

# การแก้ไข list
A = ["a", "e", "j", "o", "u"]
B = A[0: 2] + ["i"] + A[3:] # การแก้ list แบบพยายามเกิ้น
A[2] = "i"
print(A)

# -----------------------------------------------------------------------------------------

# การหาขนาด และการวน list
A = [2, 5, 1, 4, 6]

# len(list_name) คืนค่าจำนวนสมาชิกใน list
length = len(A)

for i in range(length):
    print(A[i])





