# P’Poom ขี้กังวล

&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;วันหนึ่งคุณเห็นพี่ภูมิทำหน้าเคร่งเครียดมาแต่ไกลคุณเลยเข้าไปถามว่าเข้าเป็นอะไรพี่ภูมิบอกว่าเขากังวลเกี่ยวกับเรื่องเกรดจากการสอบกลางภาคทั้ง 3 วิชาของเขา ได้แก่ วิชาคณิตศาสตร์ (M), วิชาวิทยาศาสตร์ (S) และวิชาคอมพิวเตอร์ (C) เขาบอกคุณว่าเขาจะต้องโดนว่าแน่ ๆ หากคะแนนส่งไปถึงคุณแม่ของเขา และแม่พบว่าเขาสอบได้เกรดน้อย <br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;โดยเกณฑ์ปกติของเกรด คือ ผู้เรียนจะได้เกรด S หากได้คะแนน 80 คะแนนขึ้นไป, เกรด A หากได้คะแนน 70 – 79 คะแนน, เกรด B หากได้คะแนน 60 – 69 คะแนน, เกรด C หากได้คะแนน 50 – 59 คะแนน และ ตก (FAIL) หากได้คะแนน ต่ำกว่า 50 คะแนน <br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ดังนั้นคุณซึ่งเป็นโปรแกรมเมอร์ตัวแทนของประเทศจึงช่วยพี่ภูมิเจาะระบบ และเปลี่ยนแปลงเกรดของพี่ภูมิ โดยคุณจะแก้ไขเกรดของพี่ภูมิให้เพิ่มขึ้นไป 1 ระดับ (จาก A เป็น S, จาก B เป็น A, จาก C เป็น B และจาก FAIL เป็น C) <br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;แต่ระบบของโรงเรียนของพี่ภูมินั่นเกิดขัดข้องทำให้ไม่แสดงระดับของเกรดออกมา แสดงผลแค่คะแนนแต่ละวิชา ดังนั้นนอกจากคุณจะต้องเขียนโปรแกรมเพิ่มระดับเกรดให้พี่ภูมิแล้ว คุณยังจะต้องเขียนโปรแกรมวิเคราะห์หาเกรดที่ถูกต้องจากผลคะแนนที่ได้รับมา ซึ่งคุณสามารถใช้เกณฑ์ปกติในการวิเคราะห์เกรดได้ <br>

#### ข้อมูลรับเข้า
* สามบรรทัด โดยแต่ละบรรทัดจะรับตัวอักษร 1 ตัวแทนชื่อวิชา ตามด้วยเลขจำนวนเต็มแทนคะแนนของวิชานั้น ๆ ที่พี่ภูมิได้
#### ข้อมูลส่งออก
* สามบรรทัด โดยแต่ละบรรทัดแสดงตัวอักษร 1 ตัวแทนชื่อวิชา (เรียงลำดับตามข้อมูลที่รับเข้ามา) ตามด้วยตัวอักษร 1 ตัวแทนเกรดของวิชานั้นที่ถูกเพิ่มระดับแล้ว

#### ตัวอย่าง

| Input | Output |
| :---- | :----- |
| M 79 <br> S 35 <br> C 56 | M S <br> S C <br> C B |
| S 55 <br> M 100 <br> C 60 | S B <br> M S <br> C A |
