# datastructure

A = [] # empty list มีขนาด 0
B = [2, 3, 5, 8, 4]
# 0 1 2 3 4
# 2 3 5 8 4
print(B[1])
# -5 -4 -3 -2 -1
#  2  3  5  8  4
print(B[-3])
print(B[1: 4])

# การหาขนาด len(list_name)
length = len(A)
print(length)

# list สามารถเก็บได้หลาย datatype ใน 1 list
A = [2, "4", 2.2]
print(A)

# --------------------------------------------------------------------------------------

# การบวก คือการเอา list มาต่อกัน
A = [2, "4", 2.2]
B = [3, 4, 5]
print(A + B)

# --------------------------------------------------------------------------------------

# การวนลูป
A = [1, 3, 8, 2, 11]
length = len(A)

for i in range(length):
    print(A[i])

# --------------------------------------------------------------------------------------

# sorting การเรียงลำดับ
A = ["a", "f", "bc", "ba"]
A = sorted(A)
print(A)





