# operator -> ตัวดำเนินการทางคณิตศาสตร์
# + - * / ** // %

# + (บวก)
# ถ้ามี float แม้แต่ตัวเดียวคำตอบจะเป็น float
print(3 + 4)
print(3 + 3.2)
print(3.4 + 3.6)

# - (ลบ)
# ถ้ามี float แม้แต่ตัวเดียวคำตอบจะเป็น float
print(3 - 4)
print(3 - 3.2)
print(3.4 - 3.4)

# * (คูณ)
# ถ้ามี float แม้แต่ตัวเดียวคำตอบจะเป็น float
print(2 * 3)
print(2 * 1.2)
print(2.0 * 3.0)

# / (หาร)
# คำตอบจะเป็น float เสมอ
print(4 / 2)
print(3 / 1.0)
print(4.5 / 2.8)

# ** (ยกกำลัง)
# ถ้ามี float แม้แต่ตัวเดียวคำตอบจะเป็น float
print(2 ** 3)
print(2 ** 2.5)
print(1.2 ** 3.2)

# // (หารไม่เอาเศษ)
# ถ้ามี float แม้แต่ตัวเดียวคำตอบจะเป็น float
print(5 // 3)
print(5.2 // 3)
print(10 // 3.3)
print(10.2 // 3.3)

# % (เศษจากการหาร) mod
# ถ้ามี float แม้แต่ตัวเดียวคำตอบจะเป็น float
print(5 % 3)
print(5.0 % 3)
print(5.0 % -3)
# ถ้า p และ q เป็นเลขจำนวนจริง
# p // q = s
# p % q = t
# p = s * q + t
